# Проект FitLife - MVP версия 1.0
# 3. Логика расчетов (Функции как "черный ящик": используем арифметику)
# Формула ИМТ: вес разделить на (рост в квадрате)
# TODO: Рассчитай bmi (Индекс массы тела)

def fit_life(weight, height):
    bmi = weight / (height ** 2)

# Подсчет воды: вес * 30 мл
# TODO: Рассчитай water_needed

    water_needed = weight * 30
    water_l = water_needed / 1000
    return bmi, water_l


prompt_text = ['Напишите ваше имя:\nНапример "Андрей"\n', 
               'А теперь возраст:\nДопустим "19"\n', 
               'Можно узнать ваш вес:\nНужна информация в "65" кг\n', 
               'Также потребуется рост:\nСоотвественно в метрах "1.75" через точку\n']
def main():
# 1. Знакомство
# TODO: Спроси у пользователя имя и сохрани в переменную user_name
# TODO: Спроси возраст и сохрани в переменную user_age (не забудь преобразовать в число)

    user_name, user_age = input(prompt_text[0]).strip(), int(input(prompt_text[1]))

# 2. Сбор данных
# TODO: Запроси вес (в кг) и сохрани в user_weight (тип float)
# TODO: Запроси рост (в метрах, например 1.75) и сохрани в user_height (тип float)

    user_weight, user_height = float(input(prompt_text[2])), float(input(prompt_text[3]))
    bmi, water_l = fit_life(user_weight, user_height)

# 4. Вывод красивого результата
# TODO: Используй f-строку, чтобы вывести приветствие, например: "Привет, Иван!"
# TODO: Выведи возраст, ИМТ (округленный до 1 знака) и норму воды.


    print(f'\nПривет, {user_name}!')
    print(
        f'----------------------------------------------\n'
        f'Отчет для пользователя: {user_name} ({user_age} г.)\n'
        f'Твой Индекс Массы Тела: {round(bmi, 1)}\n'
        f'Рекомендуемая норма воды: {water_l, 1} л. в день\n'
        f'----------------------------------------------\n'
        f'Расчет окончен. Будьте здоровы!\n'
    )
if __name__ == '__main__':
    main()
#print("Расчет окончен. Будьте здоровы!")
